RhinoInside.Revit API Documentation
GeometryEncoder.ToGeometryObject Method
 Converts the specified GeomertyBase object to an equivalent Revit GeometryObject.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8021
Syntax
public static Autodesk.Revit.DB.GeometryObject ToGeometryObject(
	this Rhino.Geometry.GeometryBase value
)
@staticmethod
def ToGeometryObject(
	value: Rhino.Geometry.GeometryBase
) -> Autodesk.Revit.DB.GeometryObject
Parameters
value
Type: Rhino.Geometry.GeometryBase
A value to convert.
Return Value
Type: Autodesk.Revit.DB.GeometryObject
A Revit GeometryObject that is equivalent to the provided value.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Rhino.Geometry.GeometryBase. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
GeometryEncoder Class
RhinoInside.Revit.Convert.Geometry Namespace